shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
/****************************************************************************
 * arch/arm/src/rtl8762e/rtl_serial.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "rtl_serial.h"
#if defined(CONFIG_SERIAL_RXDMA) || defined(CONFIG_SERIAL_TXDMA)
#include "rtl876x_gdma.h"
#endif
#ifdef CONFIG_PM
#include <nuttx/power/pm.h>
#include "dlps.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_RTL876x_UART

#define RTL876x_NUART 2
#if defined(CONFIG_RTL876x_UART0) || defined(CONFIG_RTL876x_UART1)
#define HAVE_UART 1
#endif

#if defined(CONFIG_RTL876x_UART0_CONSOLE)
#undef CONFIG_RTL876x_UART1_SERIAL_CONSOLE
#define CONSOLE_UART 0
#elif defined(CONFIG_RTL876x_UART1_CONSOLE)
#undef CONFIG_RTL876x_UART0_CONSOLE
#define CONSOLE_UART 1
#endif
#ifdef CONFIG_PM
#define SYSBLK_ACTCK_UART0DATA_EN_Pos (0UL)
#define SYSBLK_ACTCK_UART0DATA_EN_Msk \
                              (0x1UL << SYSBLK_ACTCK_UART0DATA_EN_Pos)
#define SYSBLK_SLPCK_UART0DATA_EN_Pos (1UL)
#define SYSBLK_SLPCK_UART0DATA_EN_Msk \
                              (0x1UL << SYSBLK_SLPCK_UART0DATA_EN_Pos)
#define SYSBLK_ACTCK_UART0DATA_EN_Pos (0UL)
#define SYSBLK_ACTCK_UART0DATA_EN_Msk \
                               (0x1UL << SYSBLK_ACTCK_UART0DATA_EN_Pos)
#define SYSBLK_SLPCK_UART0DATA_EN_Pos (1UL)
#define SYSBLK_SLPCK_UART0DATA_EN_Msk \
                               (0x1UL << SYSBLK_SLPCK_UART0DATA_EN_Pos)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct up_dev_s
{
  UART_TypeDef      *uart_base;   /* Base address of UART registers */
  bool              initialized;  /* Has been initialized and HW is setup. */
  uint32_t          baud;         /* Configured baud */
  uint8_t           parity;       /* 0=none, 1=odd, 2=even */
  uint8_t           bits;         /* Number of bits (7 or 8) */
  bool              stopbits2;    /* True: Configure with 2 stop bits */
  const uint32_t    irq;          /* IRQ associated with this UART */
  xcpt_t            handler;      /* Handler associated with this UART */
  bool              attached;     /* IRQ attach status bit */
  uint32_t          ie;           /* Saved interrupt mask bits value */
  uint32_t          sr;           /* Saved status bits */
  const uint32_t    tx_gpio;      /* UART TX GPIO pin configuration */
  const uint32_t    rx_gpio;      /* UART RX GPIO pin configuration */
  bool                rxdma_used;
  bool                txdma_used;
#if defined(CONFIG_SERIAL_RXDMA)
  GDMA_ChannelTypeDef *rxdma_base;
  uint8_t             rxdma_channel_num;
  xcpt_t              rxdma_handler;
  uint32_t            rxdma_irq; 
  uint32_t            rxdma_handshake;
#endif
#if defined(CONFIG_SERIAL_TXDMA)
  GDMA_ChannelTypeDef *txdma_base;
  uint8_t             txdma_channel_num;
  xcpt_t              txdma_handler;
  uint32_t            txdma_irq; 
  uint32_t            txdma_handshake;
  bool                txdma_running;
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#if defined(RTL876x_UART_HAVE_NODMA)
static int  rtl876x_serial_setup(struct uart_dev_s *dev);
#endif

#if defined(RTL876x_UART_HAVE_RXNODMA)
static void rtl876x_serial_rxint(struct uart_dev_s *dev, bool enable);
static int  rtl876x_serial_receive(struct uart_dev_s *dev,
                                                    unsigned int *status);
#endif

#if defined(RTL876x_UART_HAVE_TXNODMA)
static void rtl876x_serial_txint(struct uart_dev_s *dev, bool enable);
#endif

static void rtl876x_serial_send(struct uart_dev_s *dev, int ch);
static void rtl876x_serial_shutdown(struct uart_dev_s *dev);
static int  rtl876x_serial_attach(struct uart_dev_s *dev);
static void rtl876x_serial_detach(struct uart_dev_s *dev);
static int  rtl876x_serial_ioctl(struct file *filep, int cmd,
                                                       unsigned long arg);
static bool rtl876x_serial_rxavailable(struct uart_dev_s *dev);
static bool rtl876x_serial_txready(struct uart_dev_s *dev);
static bool rtl876x_serial_txempty(struct uart_dev_s *dev);
static void rtl876x_serial_switch_config(struct up_dev_s *dev);
static void rtl876x_uart_int_process(struct uart_dev_s *dev);
static void rtl876x_uart_handler(struct uart_dev_s *dev);
#ifdef CONFIG_RTL876x_UART0
static int uart0_handler(int irq, void *context, void *arg);
#endif
#ifdef CONFIG_RTL876x_UART1
static int uart1_handler(int irq, void *context, void *arg);
#endif


#if !defined(RTL876x_UART_NO_DMA)
static int  rtl876x_serial_dma_setup(struct uart_dev_s *dev);
#endif

#if defined(RTL876x_UART_HAVE_RXDMA)
static void rtl876x_serial_dma_rxint(struct uart_dev_s *dev, bool enable);
static void rtl876x_serial_dma_receive(struct uart_dev_s *dev);
static void rtl876x_serial_dma_rxfree(struct uart_dev_s *dev);
static void rtl876x_uart_rxdma_handler(struct uart_dev_s *dev);
static void rtl876x_uart_int_rxdmaprocess(struct uart_dev_s *dev);
static void rtl876x_rxdma_set_block(struct uart_dev_s *dev);
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART0_RXDMA)
static int uart0_rxdma_handler(int irq, void *context, void *arg);
#endif
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART1_RXDMA)
static int uart1_rxdma_handler(int irq, void *context, void *arg);
#endif
#endif

#if defined(RTL876x_UART_HAVE_TXDMA)
static void rtl876x_serial_dma_txint(struct uart_dev_s *dev, bool enable);
static void rtl876x_serial_dma_send(struct uart_dev_s *dev);
static void rtl876x_serial_dma_txavail(struct uart_dev_s *dev);

static void rtl876x_uart_txdma_handler(struct uart_dev_s *dev);
static void rtl876x_txdma_set_block(struct uart_dev_s *dev);
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
static int uart0_txdma_handler(int irq, void *context, void *arg);
#endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
static int uart1_txdma_handler(int irq, void *context, void *arg);
#endif
#endif

