shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
#ifdef CONFIG_PM
#if defined(CONFIG_RTL876x_UART0) || defined(CONFIG_RTL876x_UART1) 
static void uart_dlps_reg_store(uint32_t *p_buf, UART_TypeDef *UARTx);
static void uart_dlps_reg_restore(uint32_t *p_buf, UART_TypeDef *UARTx);
#endif
#if defined(RTL876x_UART0_DMA_USED) || defined(RTL876x_UART1_DMA_USED)
static void dma_dlps_reg_clear(GDMA_TypeDef *GDMAx);
static void dma_dlps_reg_store(uint32_t *p_buf, GDMA_TypeDef *GDMAx);
static void dma_dlps_reg_restore(uint32_t *p_buf, GDMA_TypeDef *GDMAx);
static void dma_channel_dlps_reg_store(uint32_t *p_buf, GDMA_ChannelTypeDef *GDMA_Channelx);
static void dma_channel_dlps_reg_restore(uint32_t *p_buf, GDMA_ChannelTypeDef *GDMA_Channelx);
volatile static uint32_t gdma_storereg[7];
#endif
#ifdef CONFIG_RTL876x_UART0
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART0_RXDMA)
volatile static uint32_t uart0_rxdma_storereg[6];
#endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
volatile static uint32_t uart0_txdma_storereg[6];
#endif
volatile static uint32_t uart0_storereg[12];
#endif

#ifdef CONFIG_RTL876x_UART1
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART1_RXDMA)
volatile static uint32_t uart1_rxdma_storereg[6];
#endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
volatile static uint32_t uart1_txdma_storereg[6];
#endif
volatile static uint32_t uart1_storereg[12];
#endif
#endif
/****************************************************************************
 * Private Data
 ****************************************************************************/

#if defined(RTL876x_UART_HAVE_NODMA)
static const struct uart_ops_s g_uart_ops =
{
  .setup          = rtl876x_serial_setup,
  .shutdown       = rtl876x_serial_shutdown,
  .attach         = rtl876x_serial_attach,
  .detach         = rtl876x_serial_detach,
  .ioctl          = rtl876x_serial_ioctl,
  .receive        = rtl876x_serial_receive,
  .rxint          = rtl876x_serial_rxint,
  .rxavailable    = rtl876x_serial_rxavailable,
  .send           = rtl876x_serial_send,
  .txint          = rtl876x_serial_txint,
  .txready        = rtl876x_serial_txready,
  .txempty        = rtl876x_serial_txempty,
};
#endif

#if (defined(CONFIG_RTL876x_UART0_TXDMA) && \
   !defined(CONFIG_RTL876x_UART0_RXDMA)) || \
   (defined(CONFIG_RTL876x_UART1_TXDMA) && \
   !defined(CONFIG_RTL876x_UART1_RXDMA))
static const struct uart_ops_s g_uart_txdma_ops =
{
  .setup          = rtl876x_serial_dma_setup,
  .shutdown       = rtl876x_serial_shutdown,
  .attach         = rtl876x_serial_attach,
  .detach         = rtl876x_serial_detach,
  .ioctl          = rtl876x_serial_ioctl,
  .receive        = rtl876x_serial_receive,
  .rxint          = rtl876x_serial_rxint,
  .rxavailable    = rtl876x_serial_rxavailable,
  .send           = rtl876x_serial_send,
  .dmasend        = rtl876x_serial_dma_send,
  .txint          = rtl876x_serial_dma_txint,
  .dmatxavail     = rtl876x_serial_dma_txavail,
  .txready        = rtl876x_serial_txready,
  .txempty        = rtl876x_serial_txempty,
};
#endif

#if (defined(CONFIG_RTL876x_UART0_RXDMA) && \
   !defined(CONFIG_RTL876x_UART0_TXDMA)) || \
   (defined(CONFIG_RTL876x_UART1_RXDMA) && \
   !defined(CONFIG_RTL876x_UART1_TXDMA))
static const struct uart_ops_s g_uart_rxdma_ops =
{
  .setup          = rtl876x_serial_dma_setup,
  .shutdown       = rtl876x_serial_shutdown,
  .attach         = rtl876x_serial_attach,
  .detach         = rtl876x_serial_detach,
  .ioctl          = rtl876x_serial_ioctl,
  .dmareceive     = rtl876x_serial_dma_receive,
  .dmarxfree      = rtl876x_serial_dma_rxfree,
  .rxint          = rtl876x_serial_dma_rxint,
  .rxavailable    = rtl876x_serial_rxavailable,
  .send           = rtl876x_serial_send,
  .txint          = rtl876x_serial_txint,
  .txready        = rtl876x_serial_txready,
  .txempty        = rtl876x_serial_txempty,
};
#endif

#if defined(RTL876x_UART_HAVE_TXRXDMA)
static const struct uart_ops_s g_uart_txrxdma_ops =
{
  .setup          = rtl876x_serial_dma_setup,
  .shutdown       = rtl876x_serial_shutdown,
  .attach         = rtl876x_serial_attach,
  .detach         = rtl876x_serial_detach,
  .ioctl          = rtl876x_serial_ioctl,
  .dmareceive     = rtl876x_serial_dma_receive,
  .dmarxfree      = rtl876x_serial_dma_rxfree,
  .rxint          = rtl876x_serial_dma_rxint,
  .rxavailable    = rtl876x_serial_rxavailable,
  .send           = rtl876x_serial_send,
  .dmasend        = rtl876x_serial_dma_send,
  .txint          = rtl876x_serial_dma_txint,
  .dmatxavail     = rtl876x_serial_dma_txavail,
  .txready        = rtl876x_serial_txready,
  .txempty        = rtl876x_serial_txempty,
};
#endif

typedef struct
{
    uint16_t div;
    uint16_t ovsr;
    uint16_t ovsr_adj;
} uart_baudrate_t;

const uart_baudrate_t baudrate_table[11] =
{
    {271, 10, 0x24a}, /* BAUD_RATE_9600    */
    {150, 8,  0x3ef}, /* BAUD_RATE_19200   */
    {20, 12,  0x252}, /* BAUD_RATE_115200  */
    {11,  10, 0x3bb}, /* BAUD_RATE_230400  */
    {11,  9,  0x084}, /* BAUD_RATE_256000  */
    {7,   9,  0x3ef}, /* BAUD_RATE_384000  */
    {6,   9,  0x0aa}, /* BAUD_RATE_460800  */
    {3,   9,  0x0aa}, /* BAUD_RATE_921600  */
    {4,   5,  0},     /* BAUD_RATE_1000000 */
    {2,   5,  0},     /* BAUD_RATE_2000000 */
    {1,   8,  0x292}, /* BAUD_RATE_3000000 */
};

/* I/O buffers */

#ifdef CONFIG_RTL876x_UART0
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART0_RXDMA)
static char g_uart0dmarxbuffer[CONFIG_RTL876x_UART0_DMA_RXBUFSIZE];
#else
static char g_uart0rxbuffer[CONFIG_RTL876x_UART0_RXBUFSIZE];
#endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
static char g_uart0dmatxbuffer[CONFIG_RTL876x_UART0_DMA_TXBUFSIZE];
#else
static char g_uart0txbuffer[CONFIG_RTL876x_UART0_TXBUFSIZE];
#endif
# endif

#ifdef CONFIG_RTL876x_UART1
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART1_RXDMA)
static char g_uart1dmarxbuffer[CONFIG_RTL876x_UART1_DMA_RXBUFSIZE];
#else
static char g_uart1rxbuffer[CONFIG_RTL876x_UART1_RXBUFSIZE];
# endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
static char g_uart1dmatxbuffer[CONFIG_RTL876x_UART1_DMA_TXBUFSIZE];
#else
static char g_uart1txbuffer[CONFIG_RTL876x_UART1_TXBUFSIZE];
#endif
#endif

#ifdef CONFIG_RTL876x_UART0
static  struct up_dev_s  g_uart0priv =
{
  .uart_base     = UART0,
  .initialized   = false,
  .irq           = Uart0_VECTORn,
  .handler       = uart0_handler,
  .attached      = false,
  .ie            = 0,
  .sr            = 0,
  .tx_gpio       = CONFIG_RTL876x_UART0_TX_PIN,
  .rx_gpio       = CONFIG_RTL876x_UART0_RX_PIN,
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART0_RXDMA)
  .rxdma_used    = true,
  .rxdma_channel_num = CONFIG_RTL876x_UART0_RXDMA_CH,
  .rxdma_handler     = uart0_rxdma_handler,
  .rxdma_handshake   = GDMA_Handshake_UART0_RX,
#endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
  .txdma_used    = true,
  .txdma_channel_num = CONFIG_RTL876x_UART0_TXDMA_CH,
  .txdma_handler     = uart0_txdma_handler,
  .txdma_handshake   = GDMA_Handshake_UART0_TX,
#endif
};

static uart_dev_t g_uart0port =
{
#if CONSOLE_UART == 0
  .isconsole = true,
#endif
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART0_RXDMA)
  .dmarx     =
  {
    .buffer  = g_uart0dmarxbuffer,
    .length  = CONFIG_RTL876x_UART0_DMA_RXBUFSIZE,
    .nbuffer = NULL,
    .nlength = 0,
    .nbytes  = 0,
  },
#endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
  .dmatx     =
  {
    .buffer  = g_uart0dmatxbuffer,
    .length  = CONFIG_RTL876x_UART0_DMA_TXBUFSIZE,
    .nbuffer = NULL,
    .nlength = 0,
    .nbytes  = 0,
  },
#endif
  .recv      =
  {
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART0_RXDMA)
    .size    = CONFIG_RTL876x_UART0_DMA_RXBUFSIZE,
    .buffer  = g_uart0dmarxbuffer,
    .head    = 0,
    .tail    = 0,
#else
    .size    = CONFIG_RTL876x_UART0_RXBUFSIZE,
    .buffer  = g_uart0rxbuffer,
    .head    = 0,
    .tail    = 0,
#endif
  },
  .xmit      =
  {
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
    .size    = CONFIG_RTL876x_UART0_DMA_TXBUFSIZE,
    .buffer  = g_uart0dmatxbuffer,
    .head    = 0,
    .tail    = 0,
#else
    .size    = CONFIG_RTL876x_UART0_TXBUFSIZE,
    .buffer  = g_uart0txbuffer,
    .head    = 0,
    .tail    = 0,
#endif
  },
#if defined(CONFIG_RTL876x_UART0_RXDMA) && \
   !defined(CONFIG_RTL876x_UART0_TXDMA)
  .ops       = &g_uart_rxdma_ops,
#elif defined(CONFIG_RTL876x_UART0_TXDMA) && \
     !defined(CONFIG_RTL876x_UART0_RXDMA)
  .ops       = &g_uart_txdma_ops,
#elif defined(CONFIG_RTL876x_UART0_TXDMA) && \
      defined(CONFIG_RTL876x_UART0_RXDMA)
  .ops       = &g_uart_txrxdma_ops,
#else
  .ops       = &g_uart_ops,
#endif
  .priv      = &g_uart0priv,
};

static int uart0_handler(int irq, void *context, void *arg)
{
    rtl876x_uart_handler(&g_uart0port);
    return OK;
}
#endif /* CONFIG_RTL876x_UART0 */

#ifdef CONFIG_RTL876x_UART1
static struct up_dev_s g_uart1priv =
{
  .uart_base     = UART1,
  .initialized   = false,
  .irq           = Uart1_VECTORn,
  .handler       = uart1_handler,
  .attached      = false,
  .ie            = 0,
  .sr            = 0,
  .tx_gpio       = CONFIG_RTL876x_UART1_TX_PIN,
  .rx_gpio       = CONFIG_RTL876x_UART1_RX_PIN,
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART1_RXDMA)
  .rxdma_used    = true,
  .rxdma_channel_num = CONFIG_RTL876x_UART1_RXDMA_CH,
  .rxdma_handler     = uart1_rxdma_handler,
  .rxdma_handshake   = GDMA_Handshake_UART1_RX,
#endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
  .txdma_used    = true,
  .txdma_channel_num = CONFIG_RTL876x_UART1_TXDMA_CH,
  .txdma_handler     = uart1_txdma_handler,
  .txdma_handshake   = GDMA_Handshake_UART1_TX,
#endif
};

static uart_dev_t g_uart1port =
{
#if CONSOLE_UART == 1
  .isconsole = true,
#endif
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART1_RXDMA)
  .dmarx     =
  {
    .buffer  = g_uart1dmarxbuffer,
    .length  = CONFIG_RTL876x_UART1_DMA_RXBUFSIZE,
    .nbuffer = NULL,
    .nlength = 0,
    .nbytes  = 0,
  },
#endif
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
  .dmatx     =
  {
    .buffer  = g_uart1dmatxbuffer,
    .length  = CONFIG_RTL876x_UART1_DMA_TXBUFSIZE,
    .nbuffer = NULL,
    .nlength = 0,
    .nbytes  = 0,
  },
#endif
  .recv      =
  {
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART1_RXDMA)
    .size    = CONFIG_RTL876x_UART1_DMA_RXBUFSIZE,
    .buffer  = g_uart1dmarxbuffer,
    .head    = 0,
    .tail    = 0,
#else
    .size    = CONFIG_RTL876x_UART1_RXBUFSIZE,
    .buffer  = g_uart1rxbuffer,
    .head    = 0,
    .tail    = 0,
#endif
  },
  .xmit      =
  {
#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
    .size    = CONFIG_RTL876x_UART1_DMA_TXBUFSIZE,
    .buffer  = g_uart1dmatxbuffer,
    .head    = 0,
    .tail    = 0,
#else
    .size    = CONFIG_RTL876x_UART1_TXBUFSIZE,
    .buffer  = g_uart1txbuffer,
    .head    = 0,
    .tail    = 0,
#endif
  },
#if defined(CONFIG_RTL876x_UART1_RXDMA) && \
   !defined(CONFIG_RTL876x_UART1_TXDMA)
  .ops       = &g_uart_rxdma_ops,
#elif defined(CONFIG_RTL876x_UART1_TXDMA) && \
     !defined(CONFIG_RTL876x_UART1_RXDMA)
  .ops       = &g_uart_txdma_ops,
#elif defined(CONFIG_RTL876x_UART1_TXDMA) && \
      defined(CONFIG_RTL876x_UART1_RXDMA)
  .ops       = &g_uart_txrxdma_ops,
#else
  .ops       = &g_uart_ops,
#endif
  .priv      = &g_uart1priv,
};

static int uart1_handler(int irq, void *context, void *arg)
{
    rtl876x_uart_handler(&g_uart1port);
    return OK;
}
#endif

static uart_dev_t * const
  g_uart_devs[RTL876x_NUART] =
{
#ifdef CONFIG_RTL876x_UART0
  [0] = &g_uart0port,
#endif
#ifdef CONFIG_RTL876x_UART1
  [1] = &g_uart1port,
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/
static void rtl876x_uart_int_process(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  /* Get the masked USART status word. */

  priv->sr = UART_GetIID(priv->uart_base);

  switch (priv->sr & 0x0E)
  {
      case UART_INT_ID_LINE_STATUS:
      {
          (void)priv->uart_base->LSR;
          break;
      }

