shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
      case UART_INT_ID_RX_DATA_TIMEOUT:
      {
          uart_recvchars(dev);
          break;
      }

      case UART_INT_ID_RX_LEVEL_REACH:
      {
          uart_recvchars(dev);
          break;
      }

      default:
          break;
  }
}


static void rtl876x_uart_handler(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  /* Loop until there are no characters to be transferred or,
   * until we have been looping for a long time.
   */

  if (UART_GetFlagStatus(priv->uart_base, UART_FLAG_RX_IDLE) == SET)
    {
      UART_INTConfig(priv->uart_base, UART_INT_RX_IDLE, DISABLE);
#if defined(RTL876x_UART_HAVE_RXDMA)
      if (priv->rxdma_used)
        {
          rtl876x_uart_int_rxdmaprocess(dev);
        }
#endif
      UART_INTConfig(priv->uart_base, UART_INT_RX_IDLE, ENABLE);
    }

#if defined(RTL876x_UART_HAVE_RXDMA)
    if (!priv->rxdma_used)
      {
        rtl876x_uart_int_process(dev);
      }
#else
    rtl876x_uart_int_process(dev);
#endif
    if (priv->uart_base->TX_DONE_INTSR)
    {
#if defined(RTL876x_UART_HAVE_RXDMA)
      if (!priv->rxdma_used)
        {
          GDMA_SuspendCmd(priv->rxdma_base, ENABLE);
        }
#endif
    }
}

/****************************************************************************
 * Name: rtl876x_serial_switch_config
 *
 * Description:
 *   SWitch baud rate by macro.
 *
 ****************************************************************************/

static void rtl876x_serial_switch_config(struct up_dev_s *dev)
{
  uint32_t baud_rate;
  uint32_t crc_parity;
  uint32_t data_bits;
  uint32_t stop_bits;
#ifdef CONFIG_RTL876x_UART0
  if (dev->uart_base == UART0)
    {
      baud_rate  = CONFIG_RTL876x_UART0_BAUD;
      crc_parity = CONFIG_RTL876x_UART0_PARITY;
      data_bits  = CONFIG_RTL876x_UART0_BITS;
      stop_bits  = CONFIG_RTL876x_UART0_2STOP;
    }
#endif
#ifdef CONFIG_RTL876x_UART1
  if (dev->uart_base == UART1)
    {
      baud_rate  = CONFIG_RTL876x_UART1_BAUD;
      crc_parity = CONFIG_RTL876x_UART1_PARITY;
      data_bits  = CONFIG_RTL876x_UART1_BITS;
      stop_bits  = CONFIG_RTL876x_UART1_2STOP;
    }
#endif
  switch (baud_rate)
    {
      case 9600:
        dev->baud = 0;
        break;
      case 19200:
        dev->baud = 1;
        break;
      case 115200:
        dev->baud = 2;
        break;
      case 230400:
        dev->baud = 3;
        break;
      case 256000:
        dev->baud = 4;
        break;
      case 384000:
        dev->baud = 5;
        break;
      case 460800:
        dev->baud = 6;
        break;
      case 921600:
        dev->baud = 7;
        break;
      case 1000000:
        dev->baud = 8;
        break;
      case 2000000:
        dev->baud = 9;
        break;
      case 3000000:
        dev->baud = 10;
        break;
      default:
        dev->baud = 2;
        break;
    }

  switch (crc_parity)
    {
      case 0:
        dev->parity = 0;
        break;
      case 1:
        dev->parity = 8;
        break;
      case 2:
        dev->parity = 24;
        break;
      default:
        dev->parity = 0;
        break;
    }

  switch (data_bits)
    {
      case 7:
        dev->bits = 0;
        break;
      case 8:
        dev->bits = 1;
        break;
      default:
        dev->bits = 1;
        break;
    }

  switch (stop_bits)
    {
      case 1:
        dev->stopbits2 = 0;
        break;
      case 2:
        dev->stopbits2 = 4;
        break;
      default:
        dev->stopbits2 = 0;
        break;
    }
}

/****************************************************************************
 * Name: rtl876x_serial_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

#if defined(RTL876x_UART_HAVE_NODMA)
static int rtl876x_serial_setup(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  /* Enable UART clock , config UART pin */

  if (!priv->initialized)
    {
#ifdef CONFIG_RTL876x_UART0
      if (priv->uart_base == UART0)
        {
          RCC_PeriphClockCmd(APBPeriph_UART0, APBPeriph_UART0_CLOCK, ENABLE);
          Pad_Config(priv->tx_gpio, PAD_PINMUX_MODE, PAD_IS_PWRON,
                              PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_HIGH);
          Pad_Config(priv->rx_gpio, PAD_PINMUX_MODE, PAD_IS_PWRON,
                              PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW);
          Pinmux_Config(priv->tx_gpio, UART0_TX);
          Pinmux_Config(priv->rx_gpio, UART0_RX);
        }
#endif
#ifdef CONFIG_RTL876x_UART1
      if (priv->uart_base == UART1)
        {
          RCC_PeriphClockCmd(APBPeriph_UART1, APBPeriph_UART0_CLOCK, ENABLE);
          Pad_Config(priv->tx_gpio, PAD_PINMUX_MODE, PAD_IS_PWRON,
                              PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_HIGH);
          Pad_Config(priv->rx_gpio, PAD_PINMUX_MODE, PAD_IS_PWRON,
                              PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW);
          Pinmux_Config(priv->tx_gpio, UART1_TX);
          Pinmux_Config(priv->rx_gpio, UART1_RX);

#if defined(CONFIG_RTL876x_UART1_FLOWCONTROL)
          Pad_Config(CONFIG_RTL876x_UART1_CTS_PIN, PAD_PINMUX_MODE, PAD_IS_PWRON,
                     PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);
          Pad_Config(CONFIG_RTL876x_UART1_RTS_PIN, PAD_PINMUX_MODE, PAD_IS_PWRON,
                     PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);

          Pinmux_Config(CONFIG_RTL876x_UART1_CTS_PIN, UART1_CTS);
          Pinmux_Config(CONFIG_RTL876x_UART1_RTS_PIN, UART1_RTS);
#endif
        }
#endif

      rtl876x_serial_switch_config(priv);
      UART_InitTypeDef UART_InitStruct;
      UART_StructInit(&UART_InitStruct);
      UART_InitStruct.UART_OvsrAdj    = baudrate_table[priv->baud].ovsr_adj;
      UART_InitStruct.UART_Div        = baudrate_table[priv->baud].div;
      UART_InitStruct.UART_Ovsr       = baudrate_table[priv->baud].ovsr;
      UART_InitStruct.UART_WordLen    = priv->bits;
      UART_InitStruct.UART_StopBits   = priv->stopbits2;
      UART_InitStruct.UART_Parity     = priv->parity;
      UART_InitStruct.UART_IdleTime   = UART_RX_IDLE_2BYTE;
      UART_InitStruct.UART_RxThdLevel = 1;
      UART_InitStruct.UART_TxThdLevel = 16;

#ifdef CONFIG_RTL876x_UART1
#if defined(CONFIG_RTL876x_UART1_FLOWCONTROL)
      if (priv->uart_base == UART1)
        {
          UART_InitStruct.UART_HardwareFlowControl = UART_HW_FLOW_CTRL_ENABLE;
        }
#endif
#endif

      UART_Init(priv->uart_base, &UART_InitStruct);

      /* Set up the cached interrupt enables value */

