shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
      priv->ie = 0;

      /* Mark device as initialized. */

      priv->initialized = true;
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: rtl876x_serial_shutdown
 *
 * Description:
 *   Disable the UART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void rtl876x_serial_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  /* Disable UART clock , releaase UART pin */

  if (priv->initialized)
    {
#if defined(CONFIG_SERIAL_RXDMA)
      if (priv->rxdma_used)
        {
          GDMA_Cmd(priv->rxdma_channel_num, DISABLE);
        }
#endif
#if defined(CONFIG_SERIAL_TXDMA)
      if (priv->txdma_used)
        {
          GDMA_Cmd(priv->txdma_channel_num, DISABLE);
        }
#endif
#ifdef CONFIG_RTL876x_UART0
      if (priv->uart_base == UART0)
        {
          RCC_PeriphClockCmd(APBPeriph_UART0,
                                           APBPeriph_UART0_CLOCK, DISABLE);
          Pad_Config(priv->tx_gpio, PAD_SW_MODE, PAD_IS_PWRON,
                              PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);
          Pad_Config(priv->rx_gpio, PAD_SW_MODE, PAD_IS_PWRON,
                              PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);
          Pinmux_Deinit(priv->tx_gpio);
          Pinmux_Deinit(priv->rx_gpio);
        }
#endif
#ifdef CONFIG_RTL876x_UART0
      if (priv->uart_base == UART1)
        {
          RCC_PeriphClockCmd(APBPeriph_UART1,
                                           APBPeriph_UART0_CLOCK, DISABLE);
          Pad_Config(priv->tx_gpio, PAD_SW_MODE, PAD_IS_PWRON,
                              PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);
          Pad_Config(priv->rx_gpio, PAD_SW_MODE, PAD_IS_PWRON,
                              PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);

          Pinmux_Deinit(priv->tx_gpio);
          Pinmux_Deinit(priv->rx_gpio);

#if defined(CONFIG_RTL876x_UART1_FLOWCONTROL)
          Pad_Config(CONFIG_RTL876x_UART1_CTS_PIN, PAD_SW_MODE, PAD_IS_PWRON,
                              PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);
          Pad_Config(CONFIG_RTL876x_UART1_RTS_PIN, PAD_SW_MODE, PAD_IS_PWRON,
                              PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);

          Pinmux_Deinit(CONFIG_RTL876x_UART1_CTS_PIN);
          Pinmux_Deinit(CONFIG_RTL876x_UART1_RTS_PIN);
#endif
        }
#endif
    }

  /* Mark device as uninitialized. */

  priv->initialized = false;
}

/****************************************************************************
 * Name: rtl876x_serial_attach
 *
 * Description:
 *   Configure the UART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).  The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 ****************************************************************************/

static int rtl876x_serial_attach(struct uart_dev_s *dev)
{
  DEBUGASSERT(dev);
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;
  DEBUGASSERT(priv);
  if (!priv->attached)
    {
      up_enable_irq(priv->irq);
      irq_attach(priv->irq, priv->handler, NULL);
#if defined(CONFIG_SERIAL_RXDMA)
      if (priv->rxdma_used)
        {
          up_enable_irq(priv->rxdma_irq);
          irq_attach(priv->rxdma_irq, priv->rxdma_handler, NULL);
        }
#endif
#if defined(CONFIG_SERIAL_TXDMA)
      if (priv->txdma_used)
        {
          up_enable_irq(priv->txdma_irq);
          irq_attach(priv->txdma_irq, priv->txdma_handler, NULL);
        }
#endif
      priv->attached = true;
    }
  return OK;
}

/****************************************************************************
 * Name: rtl876x_serial_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void rtl876x_serial_detach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;
  if (priv->attached)
    {
      irq_detach(priv->irq);
      up_disable_irq(priv->irq);
#if defined(CONFIG_SERIAL_RXDMA)
      if (priv->rxdma_used)
        {
          irq_detach(priv->rxdma_irq);
          up_disable_irq(priv->rxdma_irq);
        }
#endif
#if defined(CONFIG_SERIAL_TXDMA)
      if (priv->txdma_used)
        {
          irq_detach(priv->txdma_irq);
          up_disable_irq(priv->txdma_irq);
        }
#endif
    }

  priv->attached = false;
}

/****************************************************************************
 * Name: rtl876x_serial_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int rtl876x_serial_ioctl(struct file *filep, int cmd,
                               unsigned long arg)
{
  /* There are no platform-specific ioctl commands */

  return -ENOTTY;
}

/****************************************************************************
 * Name: rtl876x_serial_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the USART.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

#if defined(RTL876x_UART_HAVE_RXNODMA)
static int rtl876x_serial_receive(struct uart_dev_s *dev,
                                 unsigned int *status)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

