shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
  uint8_t data = priv->uart_base->RB_THR;

  /* Get the Rx byte plux error information.  Return those in status */

  *status = (priv->uart_base->LSR & 0x9e) << 16 | data;

  /* Then return the actual received byte */

  return (int)data;
}
#endif

/****************************************************************************
 * Name: rtl876x_serial_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts
 *
 ****************************************************************************/

#if defined(RTL876x_UART_HAVE_RXNODMA)
static void rtl876x_serial_rxint(struct uart_dev_s *dev, bool enable)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  /* UART receive interrupts:
   *
   * BIT          Status                        Meaning
   * ---------------- -------------- ---------------------- -------------
   * BIT0         UART_INT_RD_AVA               Received Data Ready
   *                                            to be Read
   * BIT2         UART_INT_RX_LINE_STS          Framing Error
   * BIT6         UART_INT_RX_BREAK             Break error
   * BIT7         UART_INT_RX_IDLE              Rx line idle
   */

  irqstate_t flags;
  flags = enter_critical_section();
  if (enable)
    {
      /* Receive an interrupt when their is anything in the Rx data
       * register (or an Rx timeout occurs).
       */

      UART_INTConfig(priv->uart_base, UART_INT_RD_AVA,  ENABLE);
      UART_INTConfig(priv->uart_base, UART_INT_RX_IDLE, ENABLE);
      UART_MaskINTConfig(priv->uart_base, UART_INT_MASK_RD_AVA,  DISABLE);
      UART_MaskINTConfig(priv->uart_base, UART_INT_MASK_RX_IDLE, DISABLE);
      priv->ie |= UART_INT_RD_AVA | UART_INT_RX_IDLE;
  #ifdef CONFIG_UART_ERRINTS
      UART_INTConfig(priv->uart_base, UART_INT_RX_BREAK,    ENABLE);
      UART_INTConfig(priv->uart_base, UART_INT_RX_LINE_STS, ENABLE);
      UART_MaskINTConfig(priv->uart_base,
                                       UART_INT_MASK_RX_BREAK, DISABLE);
      UART_MaskINTConfig(priv->uart_base,
                                    UART_INT_MASK_RX_LINE_STS, DISABLE);
      priv->ie |= UART_INT_RX_BREAK | UART_INT_RX_LINE_STS;
  #endif
    }
  else
    {
      UART_INTConfig(priv->uart_base, UART_INT_RD_AVA,  DISABLE);
      UART_INTConfig(priv->uart_base, UART_INT_RX_IDLE, DISABLE);
      UART_MaskINTConfig(priv->uart_base, UART_INT_MASK_RD_AVA,  ENABLE);
      UART_MaskINTConfig(priv->uart_base, UART_INT_MASK_RX_IDLE, ENABLE);
      priv->ie &= ~(UART_INT_RD_AVA | UART_INT_RX_IDLE);
  #ifdef CONFIG_UART_ERRINTS
      UART_INTConfig(priv->uart_base, UART_INT_RX_BREAK,    DISABLE);
      UART_INTConfig(priv->uart_base, UART_INT_RX_LINE_STS, DISABLE);
      UART_MaskINTConfig(priv->uart_base, UART_INT_MASK_RX_BREAK,    ENABLE);
      UART_MaskINTConfig(priv->uart_base, UART_INT_MASK_RX_LINE_STS, ENABLE);
      priv->ie &= ~(UART_INT_RX_BREAK | UART_INT_RX_LINE_STS);
  #endif
    }

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: rtl876x_serial_rxavailable
 *
 * Description:
 *   Return true if the receive register is not empty
 *
 ****************************************************************************/

static bool rtl876x_serial_rxavailable(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  return (priv->uart_base->LSR & BIT0);
}

/****************************************************************************
 * Name: rtl876x_serial_send
 *
 * Description:
 *   This method will send one byte on the USART
 *
 ****************************************************************************/

static void rtl876x_serial_send(struct uart_dev_s *dev, int ch)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  priv->uart_base->RB_THR = ch;
}

/****************************************************************************
 * Name: rtl876x_serial_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/
#if defined(RTL876x_UART_HAVE_TXNODMA)
static void rtl876x_serial_txint(struct uart_dev_s *dev, bool enable)
{
  uint16_t nbytes = 0;

  /* USART transmit interrupts:
   *
   * BIT          Status                        Meaning
   * --------------- ------------- ---------------------------- -------------
   * BIT1         UART_INT_TX_FIFO_EMPTY        Transmit Data Register Empty
   * BIT4         UART_INT_TX_DONE              Transmission Complete
   */

  if (!enable)
    {
      /* Disable the TX interrupt */
      return;
    }

  while (dev->xmit.head != dev->xmit.tail)
    {
      while (!rtl876x_serial_txready(dev));

      rtl876x_serial_send(dev, dev->xmit.buffer[dev->xmit.tail]);

      /* Increment the tail index */

      if (++(dev->xmit.tail) >= dev->xmit.size)
        {
          dev->xmit.tail = 0;
        }

      nbytes++;
    }

  /* If any bytes were removed from the buffer, inform any waiters that
   * there is space available.
   */

  if (nbytes)
    {
      uart_datasent(dev);
    }

}
#endif
/****************************************************************************
 * Name: rtl876x_serial_txready
 *
 * Description:
 *   Return true if the transmit data register is ready
 *
 ****************************************************************************/

static bool rtl876x_serial_txready(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  return ((priv->uart_base->FIFO_LEVEL & 0x1f) < 15);
}

/****************************************************************************
 * Name: rtl876x_serial_txempty
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

static bool rtl876x_serial_txempty(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  return (priv->uart_base->LSR & BIT6);
}

#if !defined(RTL876x_UART_NO_DMA)
static int rtl876x_serial_dma_setup(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
  (struct up_dev_s *)dev->priv;

