shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
  /* Enable UART clock , config UART pin */

  if (!priv->initialized)
    {
      RCC_PeriphClockCmd(APBPeriph_GDMA, APBPeriph_GDMA_CLOCK, ENABLE);
      GDMA_InitTypeDef GDMA_InitStruct;
      UART_InitTypeDef UART_InitStruct;
      if (priv->uart_base == UART0)
        {
          RCC_PeriphClockCmd(APBPeriph_UART0, \
                                       APBPeriph_UART0_CLOCK, ENABLE);
          Pinmux_Config(priv->tx_gpio, UART0_TX);
          Pinmux_Config(priv->rx_gpio, UART0_RX);
        }
      else if (priv->uart_base == UART1)
        {
          RCC_PeriphClockCmd(APBPeriph_UART1, APBPeriph_UART0_CLOCK, ENABLE);
          Pinmux_Config(priv->tx_gpio, UART1_TX);
          Pinmux_Config(priv->rx_gpio, UART1_RX);
        }
      Pad_Config(priv->tx_gpio, PAD_PINMUX_MODE, PAD_IS_PWRON,
                          PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_HIGH);
      Pad_Config(priv->rx_gpio, PAD_PINMUX_MODE, PAD_IS_PWRON,
                          PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW);

      rtl876x_serial_switch_config(priv);
      UART_StructInit(&UART_InitStruct);
      UART_InitStruct.UART_OvsrAdj      = baudrate_table[priv->baud].ovsr_adj;
      UART_InitStruct.UART_Div          = baudrate_table[priv->baud].div;
      UART_InitStruct.UART_Ovsr         = baudrate_table[priv->baud].ovsr;
      UART_InitStruct.UART_WordLen      = priv->bits;
      UART_InitStruct.UART_StopBits     = priv->stopbits2;
      UART_InitStruct.UART_Parity       = priv->parity;
      if (priv->baud >= 8)
        {
          UART_InitStruct.UART_IdleTime   = UART_RX_IDLE_128BYTE;
        }
      else if (priv->baud >= 7)
        {
          UART_InitStruct.UART_IdleTime   = UART_RX_IDLE_64BYTE;
        }
      else
        {
          UART_InitStruct.UART_IdleTime   = UART_RX_IDLE_4BYTE;
        }
      UART_InitStruct.UART_RxThdLevel = 1;
      UART_InitStruct.UART_TxThdLevel = 16;
      UART_InitStruct.UART_DmaEn        = UART_DMA_ENABLE;
#if defined(CONFIG_SERIAL_RXDMA)
      if (priv->rxdma_used)
        {
          UART_InitStruct.UART_RxDmaEn      = ENABLE;
          UART_InitStruct.UART_RxWaterLevel = 1;
          switch (priv->rxdma_channel_num)
            {
              case 0:
                priv->rxdma_base = GDMA_Channel0;
                priv->rxdma_irq  = GDMA0_Channel0_VECTORn;
                break;
              case 1:
                priv->rxdma_base = GDMA_Channel1;
                priv->rxdma_irq  = GDMA0_Channel1_VECTORn;
                break;
              case 2:
                priv->rxdma_base = GDMA_Channel2;
                priv->rxdma_irq  = GDMA0_Channel2_VECTORn;
                break;
              case 3:
                priv->rxdma_base = GDMA_Channel3;
                priv->rxdma_irq  = GDMA0_Channel3_VECTORn;
                break;
            }
        }
#endif
#if defined(CONFIG_SERIAL_TXDMA)
      if (priv->txdma_used)
        {
          UART_InitStruct.UART_TxDmaEn      = ENABLE;
          UART_InitStruct.UART_TxWaterLevel = 15;
          switch (priv->txdma_channel_num)
            {
              case 0:
                priv->txdma_base = GDMA_Channel0;
                priv->txdma_irq  = GDMA0_Channel0_VECTORn;
                break;
              case 1:
                priv->txdma_base = GDMA_Channel1;
                priv->txdma_irq  = GDMA0_Channel1_VECTORn;
                break;
              case 2:
                priv->txdma_base = GDMA_Channel2;
                priv->txdma_irq  = GDMA0_Channel2_VECTORn;
                break;
              case 3:
                priv->txdma_base = GDMA_Channel3;
                priv->txdma_irq  = GDMA0_Channel3_VECTORn;
                break;
            }
        }
#endif
      UART_Init(priv->uart_base, &UART_InitStruct);

      /* Initialize GDMA */

#if defined(CONFIG_SERIAL_RXDMA)
      if (priv->rxdma_used)
        {
          GDMA_StructInit(&GDMA_InitStruct);
          GDMA_InitStruct.GDMA_ChannelNum          = priv->rxdma_channel_num;
          GDMA_InitStruct.GDMA_DIR                 = GDMA_DIR_PeripheralToMemory;
          GDMA_InitStruct.GDMA_SourceInc           = DMA_SourceInc_Fix;
          GDMA_InitStruct.GDMA_DestinationInc      = DMA_DestinationInc_Inc;
          GDMA_InitStruct.GDMA_SourceDataSize      = GDMA_DataSize_Byte;
          GDMA_InitStruct.GDMA_DestinationDataSize = GDMA_DataSize_Byte;
          GDMA_InitStruct.GDMA_SourceMsize         = GDMA_Msize_1;
          GDMA_InitStruct.GDMA_DestinationMsize    = GDMA_Msize_1;
          GDMA_InitStruct.GDMA_SourceAddr          = \
                                    (uint32_t)(&(priv->uart_base->RB_THR));
          GDMA_InitStruct.GDMA_DestinationAddr     = (uint32_t)dev->dmarx.buffer;
          GDMA_InitStruct.GDMA_BufferSize          = dev->dmarx.length;
          GDMA_InitStruct.GDMA_SourceHandshake     = priv->rxdma_handshake;

          GDMA_Init(priv->rxdma_base, &GDMA_InitStruct);
        }
#endif
#if defined(CONFIG_SERIAL_TXDMA)
      if (priv->txdma_used)
        {
          GDMA_StructInit(&GDMA_InitStruct);
          GDMA_InitStruct.GDMA_ChannelNum          = priv->txdma_channel_num;
          GDMA_InitStruct.GDMA_DIR                 = GDMA_DIR_MemoryToPeripheral;
          GDMA_InitStruct.GDMA_SourceInc           = DMA_SourceInc_Inc;
          GDMA_InitStruct.GDMA_DestinationInc      = DMA_DestinationInc_Fix;
          GDMA_InitStruct.GDMA_SourceDataSize      = GDMA_DataSize_Byte;
          GDMA_InitStruct.GDMA_DestinationDataSize = GDMA_DataSize_Byte;
          GDMA_InitStruct.GDMA_SourceMsize         = GDMA_Msize_1;
          GDMA_InitStruct.GDMA_DestinationMsize    = GDMA_Msize_1;
          GDMA_InitStruct.GDMA_SourceAddr          = (uint32_t)dev->dmatx.buffer;
          GDMA_InitStruct.GDMA_DestinationAddr     = \
                                          (uint32_t)(&(priv->uart_base->RB_THR));
          GDMA_InitStruct.GDMA_BufferSize          = dev->dmatx.length;
          GDMA_InitStruct.GDMA_SourceHandshake     = priv->txdma_handshake;

