shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
          GDMA_Init(priv->txdma_base, &GDMA_InitStruct);
        }
#endif
      /* Set up the cached interrupt enables value */

      priv->ie = 0;

      /* Mark device as initialized. */

      priv->initialized = true;
    }

  return OK;
}
#endif

#if defined(RTL876x_UART_HAVE_RXDMA)
static void rtl876x_serial_dma_receive(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;
  GDMA_Cmd(priv->rxdma_channel_num, DISABLE);
  rtl876x_rxdma_set_block(dev);
  GDMA_SuspendCmd(priv->rxdma_base, DISABLE);
  GDMA_Cmd(priv->rxdma_channel_num, ENABLE);
}

static void rtl876x_rxdma_set_block(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  struct uart_dmaxfer_s *xfer = &dev->dmarx;

  irqstate_t flags;
  flags = enter_critical_section();

  /* single block */

  if (xfer->length > 0)
    {
      priv->rxdma_base->DAR = (uint32_t)xfer->buffer;
      priv->rxdma_base->CTL_HIGH = (uint32_t)xfer->length;
    }
  else if (xfer->nlength > 0)
    {
      priv->rxdma_base->DAR = (uint32_t)xfer->nbuffer;
      priv->rxdma_base->CTL_HIGH = (uint32_t)xfer->nlength;
    }

  leave_critical_section(flags);
}

static void rtl876x_serial_dma_rxint(struct uart_dev_s *dev, bool enable)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  irqstate_t flags;
  flags = enter_critical_section();
  if (enable)
    {
      /* Receive an interrupt when their is anything in the Rx data
       * register (or an Rx timeout occurs).
       */

      UART_INTConfig(priv->uart_base, UART_INT_RX_IDLE, ENABLE);
      UART_MaskINTConfig(priv->uart_base, UART_INT_MASK_RX_IDLE, DISABLE);
      priv->ie |= UART_INT_RX_IDLE;
      GDMA_INTConfig(priv->rxdma_channel_num, GDMA_INT_Transfer, ENABLE);

      uart_recvchars_dma(dev);
    }
  else
    {
      UART_INTConfig(priv->uart_base, UART_INT_RX_IDLE, DISABLE);
      UART_MaskINTConfig(priv->uart_base, UART_INT_MASK_RX_IDLE, ENABLE);
      priv->ie &= ~(UART_INT_RX_IDLE);
      GDMA_INTConfig(priv->rxdma_channel_num, GDMA_INT_Transfer, DISABLE);
    }

  leave_critical_section(flags);

}

static void rtl876x_serial_dma_rxfree(struct uart_dev_s *dev)
{
}

#ifdef CONFIG_RTL876x_UART0_RXDMA
static int uart0_rxdma_handler(int irq, void *context, void *arg)
{
  rtl876x_uart_rxdma_handler(&g_uart0port);
  return OK;
}
#endif
#ifdef CONFIG_RTL876x_UART1_RXDMA
static int uart1_rxdma_handler(int irq, void *context, void *arg)
{
  rtl876x_uart_rxdma_handler(&g_uart1port);
  return OK;
}
#endif

static void rtl876x_uart_rxdma_handler(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;
  GDMA_SuspendCmd(priv->rxdma_base, ENABLE);
  GDMA_ClearINTPendingBit(priv->rxdma_channel_num, GDMA_INT_Transfer);

  struct uart_dmaxfer_s *xfer = &dev->dmarx;
  xfer->nbytes = GDMA_GetTransferLen(priv->rxdma_base);

  GDMA_SuspendCmd(priv->rxdma_base, DISABLE);
  uart_recvchars_done(dev);
}

static void rtl876x_uart_int_rxdmaprocess(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;
  GDMA_SuspendCmd(priv->rxdma_base, ENABLE);
  if (priv->uart_base->LSR & BIT0)
    {
      GDMA_SuspendCmd(priv->rxdma_base, DISABLE);
      return;
    }
  struct uart_dmaxfer_s *xfer = &dev->dmarx;
  xfer->nbytes = GDMA_GetTransferLen(priv->rxdma_base);
  GDMA_SuspendCmd(priv->rxdma_base, DISABLE);
  GDMA_Cmd(priv->rxdma_channel_num, DISABLE);
  uart_recvchars_done(dev);
}

#endif /* RTL876x_UART_HAVE_RXDMA */


/****************************************************************************
 * Public Functions
 ****************************************************************************/

#ifdef RTL876x_UART_HAVE_TXDMA
static void rtl876x_serial_dma_txint(struct uart_dev_s *dev, bool enable)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;
  irqstate_t flags;
  flags = enter_critical_section();

  if (enable)
    {
      /* Set to receive an interrupt when the TX data register is empty */

        GDMA_INTConfig(priv->txdma_channel_num, GDMA_INT_Transfer, ENABLE);
        if (!priv->txdma_running)
          {
            GDMA_SuspendCmd(priv->txdma_base,ENABLE);
            uart_xmitchars_dma(dev);
          }
    }
  else
    {
      /* Disable the TX interrupt */

      GDMA_INTConfig(priv->txdma_channel_num, GDMA_INT_Transfer, DISABLE);
    }

  leave_critical_section(flags);

}

static void rtl876x_serial_dma_send(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;
  GDMA_Cmd(priv->txdma_channel_num, DISABLE);
  rtl876x_txdma_set_block(dev);
  GDMA_SuspendCmd(priv->txdma_base, DISABLE);
  priv->txdma_running = true;
  GDMA_Cmd(priv->txdma_channel_num, ENABLE);
}

static void rtl876x_txdma_set_block(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;

  struct uart_dmaxfer_s *xfer = &dev->dmatx;

  irqstate_t flags;
  flags = enter_critical_section();

  /* single block */

  if (xfer->length > 0)
    {
      priv->txdma_base->SAR = (uint32_t)xfer->buffer;
      priv->txdma_base->CTL_HIGH = (uint32_t)xfer->length;
    }
  else if (xfer->nlength > 0)
    {
      priv->txdma_base->SAR = (uint32_t)xfer->nbuffer;
      priv->txdma_base->CTL_HIGH = (uint32_t)xfer->nlength;
    }

  leave_critical_section(flags);
}

static void rtl876x_serial_dma_txavail(struct uart_dev_s *dev)
{

}

#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
static int uart0_txdma_handler(int irq, void *context, void *arg)
{
  rtl876x_uart_txdma_handler(&g_uart0port);
  return OK;
}
#endif

#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
static int uart1_txdma_handler(int irq, void *context, void *arg)
{
  rtl876x_uart_txdma_handler(&g_uart1port);
  return OK;

}
#endif

static void rtl876x_uart_txdma_handler(struct uart_dev_s *dev)
{
  struct up_dev_s *priv =
    (struct up_dev_s *)dev->priv;
  priv->txdma_running = false;

  GDMA_INTConfig(priv->txdma_channel_num, GDMA_INT_Transfer, DISABLE);
  GDMA_ClearINTPendingBit(priv->txdma_channel_num, GDMA_INT_Transfer);
  struct uart_dmaxfer_s *xfer = &dev->dmatx;
  xfer->nbytes = GDMA_GetTransferLen(priv->txdma_base);
  uart_xmitchars_done(dev);
}
#endif

/****************************************************************************
 * Name: arm_earlyserialinit
 *
 * Description:
 *   Performs the low level UART initialization early in debug so that the
 *   serial console will be available during bootup.  This must be called
 *   before arm_serialinit.
 *
 ****************************************************************************/

#ifdef USE_EARLYSERIALINIT
void arm_earlyserialinit(void)
{
#ifdef HAVE_UART

  /* Configure whichever one is the console */

#if CONSOLE_UART >= 0
  g_uart_devs[CONSOLE_UART]->ops->setup(g_uart_devs[CONSOLE_UART]);
#endif
#endif /* HAVE UART */
}
#endif /* USE_EARLYSERIALINIT */

