shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
#ifdef CONFIG_PM
static bool console_dlps_check_cb(uint32_t * p_value)
{
  if (!rtl876x_serial_txempty(g_uart_devs[CONSOLE_UART]))
    {
      return false;
    }

  *p_value = UINT32_MAX - 1;
  return true;
}
#endif

/****************************************************************************
 * Name: arm_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes
 *   that arm_earlyserialinit was called previously.
 *
 ****************************************************************************/

void arm_serialinit(void)
{
#ifdef HAVE_UART
  char devname[16];
  unsigned i;
  unsigned minor = 0;
#if CONSOLE_UART >= 0

  uart_register("/dev/console", g_uart_devs[CONSOLE_UART]);

#ifdef CONFIG_PM
  dlps_check_cb_reg((DLPSEnterCheckFunc)console_dlps_check_cb);
#endif

  /* Register the console UART to ttyS0 and exclude
   * it from initializing it further down
   */

  uart_register("/dev/ttyS0", g_uart_devs[CONSOLE_UART]);
  minor = 1;
#endif /* CONSOLE_UART >= 0 */

  /* Register all remaining UARTs */

  strlcpy(devname, "/dev/ttySx", sizeof(devname));
  for (i = 0; i < RTL876x_NUART; i++)
    {

      /* Don't create a device for non-configured ports. */

      if (g_uart_devs[i] == 0)
        {
          continue;
        }

      /* Don't create a device for the console - we did that above */

      if (g_uart_devs[i]->isconsole)
        {
          continue;
        }

      /* Register USARTs as devices in increasing order */

      devname[9] = '0' + minor++;
      uart_register(devname, g_uart_devs[i]);
    }

#endif /* HAVE UART */
}

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

void arm_lowputc(char ch)
{
      /* Wait until the TX data register is ready */

      while (!rtl876x_serial_txready(g_uart_devs[CONSOLE_UART]));

      /* Then send the character */

      rtl876x_serial_send(g_uart_devs[CONSOLE_UART], ch);
}

int up_putc(int ch)
{
  irqstate_t flags;
  flags = enter_critical_section();
#if CONSOLE_UART >= 0

  /* Check for LF */

  if (ch == '\n')
    {
      /* Add CR */

      arm_lowputc('\r');
    }

  arm_lowputc(ch);

#endif
  leave_critical_section(flags);
  return ch;
}


#ifdef CONFIG_PM
#define DATA_RAM_FUNCTION  __attribute__((section(".app.data_ram.text")))
#if defined(CONFIG_RTL876x_UART0) || defined(CONFIG_RTL876x_UART1) 
DATA_RAM_FUNCTION
static void uart_dlps_reg_store(uint32_t *p_buf, UART_TypeDef *UARTx)
{
  UARTx->LCR |= (1 << 7);
  memcpy((uint32_t *)&p_buf[0], (uint32_t *)&UARTx->DLL, 8);
  UARTx->LCR &= (~(1 << 7));

  p_buf[2] = UARTx->DLH_INTCR;
  memcpy((uint32_t *)&p_buf[4], (uint32_t *)&UARTx->LCR, 8);
  memcpy((uint32_t *)&p_buf[6], (uint32_t *)&UARTx->SPR, 8);
  p_buf[8] = UARTx->RX_IDLE_TOCR;
  p_buf[9] = UARTx->RX_IDLE_INTCR;
  p_buf[10] = UARTx->MISCR;
  p_buf[11] = UARTx->INTMASK;
}

DATA_RAM_FUNCTION
static void uart_dlps_reg_restore(uint32_t *p_buf, UART_TypeDef *UARTx)
{
  UARTx->LCR |= (1 << 7);
  memcpy((uint32_t *)&UARTx->DLL, (uint32_t *)&p_buf[0], 8);
  UARTx->LCR &= (~(1 << 7));

  UARTx->INTID_FCR = (((p_buf[7] & BIT24) >> 21) | ((p_buf[7] & 0x7C000000) >> 18) |
                      (1));
  memcpy((uint32_t *)&UARTx->LCR, (uint32_t *)&p_buf[4], 8);
  memcpy((uint32_t *)&UARTx->SPR, (uint32_t *)&p_buf[6], 8);
  UARTx->DLH_INTCR = p_buf[2];
  UARTx->RX_IDLE_TOCR = p_buf[8];
  UARTx->RX_IDLE_INTCR = p_buf[9];
  UARTx->MISCR = p_buf[10];
  UARTx->INTMASK = p_buf[11];
}

#if defined(RTL876x_UART0_DMA_USED) || defined(RTL876x_UART1_DMA_USED)
DATA_RAM_FUNCTION
static void dma_dlps_reg_clear(GDMA_TypeDef *GDMAx)
{
  GDMAx->CLEAR_TFR = 0xff;
  GDMAx->CLEAR_BLOCK = 0xff;
  GDMAx->CLEAR_DST_TRAN = 0xff;
  GDMAx->CLEAR_SRC_TRAN = 0xff;
  GDMAx->CLEAR_ERR = 0xff;
}

static void dma_dlps_reg_store(uint32_t *p_buf, GDMA_TypeDef *GDMAx)
{
  p_buf[0] = GDMAx->DmaCfgReg;
  p_buf[1] = GDMAx->ChEnReg;
  p_buf[2] = GDMAx->MASK_TFR;
  p_buf[3] = GDMAx->MASK_BLOCK;
  p_buf[4] = GDMAx->MASK_SRC_TRAN;
  p_buf[5] = GDMAx->MASK_DST_TRAN;
  p_buf[6] = GDMAx->MASK_ERR;
}

DATA_RAM_FUNCTION
static void dma_dlps_reg_restore(uint32_t *p_buf, GDMA_TypeDef *GDMAx)
{
  GDMAx->DmaCfgReg = p_buf[0];
  dma_dlps_reg_clear(GDMAx);

  GDMAx->MASK_TFR = (p_buf[2] | ((p_buf[2] & 0xff) << 8));
  GDMAx->MASK_BLOCK = (p_buf[3] | ((p_buf[3] & 0xff) << 8));
  GDMAx->MASK_SRC_TRAN = (p_buf[4] | ((p_buf[4] & 0xff) << 8));
  GDMAx->MASK_DST_TRAN = (p_buf[5] | ((p_buf[5] & 0xff) << 8));
  GDMAx->MASK_ERR = (p_buf[6] | ((p_buf[6] & 0xff) << 8));
}

DATA_RAM_FUNCTION
static void dma_channel_dlps_reg_store(uint32_t *p_buf, GDMA_ChannelTypeDef *GDMA_Channelx)
{
  p_buf[0] = GDMA_Channelx->SAR;
  p_buf[1] = GDMA_Channelx->DAR;
  p_buf[2] = GDMA_Channelx->CTL_LOW;
  p_buf[3] = GDMA_Channelx->CTL_HIGH;
  p_buf[4] = GDMA_Channelx->CFG_LOW;
  p_buf[5] = GDMA_Channelx->CFG_HIGH;
}

DATA_RAM_FUNCTION
static void dma_channel_dlps_reg_restore(uint32_t *p_buf, GDMA_ChannelTypeDef *GDMA_Channelx)
{
  GDMA_Channelx->SAR      = p_buf[0];
  GDMA_Channelx->DAR      = p_buf[1];
  GDMA_Channelx->CTL_LOW  = p_buf[2];
  GDMA_Channelx->CTL_HIGH = p_buf[3];
  GDMA_Channelx->CFG_LOW  = p_buf[4];
  GDMA_Channelx->CFG_HIGH = p_buf[5];
}

#endif
#endif

#ifdef CONFIG_RTL876x_UART0
DATA_RAM_FUNCTION
static void uart0_dlps_enter(void)
{
  RCC_PeriphClockCmd(APBPeriph_UART0, APBPeriph_UART0_CLOCK, ENABLE);
  uart_dlps_reg_store((uint32_t *)&uart0_storereg[0], UART0);

#if defined(RTL876x_UART0_DMA_USED)
  RCC_PeriphClockCmd(APBPeriph_GDMA, APBPeriph_GDMA_CLOCK, ENABLE);
  dma_dlps_reg_store((uint32_t *)&gdma_storereg[0], GDMA_BASE);

#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
  dma_channel_dlps_reg_store((uint32_t *)&uart0_txdma_storereg[0], g_uart0priv.txdma_base);
#endif
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART0_RXDMA)
  dma_channel_dlps_reg_store((uint32_t *)&uart0_rxdma_storereg[0], g_uart0priv.rxdma_base);
  uart0_rxdma_storereg[3] = 32;
#endif
#endif
    return;
}

