shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/chips/rtl8762e/rtl_serial.c
DATA_RAM_FUNCTION
static void uart0_dlps_exit(void)
{
  RCC_PeriphClockCmd(APBPeriph_UART0, APBPeriph_UART0_CLOCK, ENABLE);
  uart_dlps_reg_restore((uint32_t *)&uart0_storereg[0], UART0);

#if defined(RTL876x_UART0_DMA_USED)
  RCC_PeriphClockCmd(APBPeriph_GDMA, APBPeriph_GDMA_CLOCK, ENABLE);
  dma_dlps_reg_restore((uint32_t *)&gdma_storereg[0], GDMA_BASE);

#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART0_TXDMA)
  dma_channel_dlps_reg_restore((uint32_t *)&uart0_txdma_storereg[0], g_uart0priv.txdma_base);
#endif
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART0_RXDMA)
  dma_channel_dlps_reg_restore((uint32_t *)&uart0_rxdma_storereg[0], g_uart0priv.rxdma_base);
#endif
  dma_dlps_reg_clear(GDMA_BASE);
  GDMA_Cmd(g_uart0priv.rxdma_channel_num, ENABLE);
#endif
  return;
}

#if (defined CONFIG_RTL876x_UART0_CONSOLE)
static void uart0_weakup_handler(void)
{
  if (System_WakeUpInterruptValue(CONFIG_RTL876x_UART0_RX_PIN) == SET)
    {
      System_WakeUpPinDisable(CONFIG_RTL876x_UART0_RX_PIN);
      pm_activity(PM_IDLE_DOMAIN,
                  CONFIG_SERIAL_PM_ACTIVITY_PRIORITY);
    }
}
#endif

static struct dlps_driver_ops rtl_pm_uart0_driver_ops
	__attribute__((section(".dlps.dataon.data")))
	__attribute__((__used__)) = {
    NULL,
    uart0_dlps_enter,
    uart0_dlps_exit,
#if (defined CONFIG_RTL876x_UART0_CONSOLE)
    uart0_weakup_handler,
#endif
};
#endif

#ifdef CONFIG_RTL876x_UART1
DATA_RAM_FUNCTION
static void uart1_dlps_enter(void)
{
  RCC_PeriphClockCmd(APBPeriph_UART1, APBPeriph_UART1_CLOCK, ENABLE);
  uart_dlps_reg_store((uint32_t *)&uart1_storereg[0], UART1);

#if defined(RTL876x_UART1_DMA_USED)
  RCC_PeriphClockCmd(APBPeriph_GDMA, APBPeriph_GDMA_CLOCK, ENABLE);
  dma_dlps_reg_store((uint32_t *)&gdma_storereg[0], GDMA_BASE);

#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
  dma_channel_dlps_reg_store((uint32_t *)&uart1_txdma_storereg[0], g_uart1priv.txdma_base);
#endif
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART1_RXDMA)
  dma_channel_dlps_reg_store((uint32_t *)&uart1_rxdma_storereg[0], g_uart1priv.rxdma_base);
#endif
#endif
    return;
}

DATA_RAM_FUNCTION
static void uart1_dlps_exit(void)
{
  RCC_PeriphClockCmd(APBPeriph_UART1, APBPeriph_UART1_CLOCK, ENABLE);
  uart_dlps_reg_restore((uint32_t *)&uart1_storereg[0], UART1);

#if defined(RTL876x_UART1_DMA_USED)
  RCC_PeriphClockCmd(APBPeriph_GDMA, APBPeriph_GDMA_CLOCK, ENABLE);
  dma_dlps_reg_restore((uint32_t *)&gdma_storereg[0], GDMA_BASE);

#if defined(CONFIG_SERIAL_TXDMA) && defined(CONFIG_RTL876x_UART1_TXDMA)
  dma_channel_dlps_reg_restore((uint32_t *)&uart1_txdma_storereg[0], g_uart1priv.txdma_base);
#endif
#if defined(CONFIG_SERIAL_RXDMA) && defined(CONFIG_RTL876x_UART1_RXDMA)
  dma_channel_dlps_reg_restore((uint32_t *)&uart1_rxdma_storereg[0], g_uart1priv.rxdma_base);
#endif
  dma_dlps_reg_clear(GDMA_BASE);
#endif

  return;
}

#if (defined CONFIG_RTL876x_UART1_CONSOLE)
static void uart1_weakup_handler(void)
{
  if (System_WakeUpInterruptValue(CONFIG_RTL876x_UART1_RX_PIN) == SET)
    {
      System_WakeUpPinDisable(CONFIG_RTL876x_UART1_RX_PIN);
      pm_activity(PM_IDLE_DOMAIN,
                  CONFIG_SERIAL_PM_ACTIVITY_PRIORITY);
    }
}
#endif

static struct dlps_driver_ops rtl_pm_uart1_driver_ops
	__attribute__((section(".dlps.dataon.data")))
	__attribute__((__used__)) = {
    NULL,
    uart1_dlps_enter,
    uart1_dlps_exit,
#if (defined CONFIG_RTL876x_UART1_CONSOLE)
    uart1_weakup_handler,
#endif
};

#endif
#endif

#endif /* CONFIG_RTL876x_UART */

